In [28]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [16]:
# 패키지 임포트
import numpy as np
import pandas as pd

In [4]:
#warning 비활성화
import warnings
warnings.filterwarnings('ignore')

In [3]:
# seaborn 패키지의 titanic 데이터셋을 load 하시오
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

#### 연습문제 1
- 타이타닉 호 승객에 대해서, 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive)인원수를 구하시오.

- 성별 인원수는 인덱스 기준으로 정렬하고
- 나이별 인원수는 값 기준 정렬
- 그 나머지는 임의 기준 정렬 하시오.

In [8]:
#2,여러개,3개,2개 -> 각자 달라서 각각 시리즈 형태로 
#성별 인원수
titanic['sex'].value_counts().sort_index()

female    314
male      577
Name: sex, dtype: int64

In [9]:
#age 인원수
titanic['age'].value_counts().sort_index()

0.42     1
0.67     1
0.75     2
0.83     2
0.92     1
        ..
70.00    2
70.50    1
71.00    2
74.00    1
80.00    1
Name: age, Length: 88, dtype: int64

In [12]:
#class 인원수
titanic['class'].value_counts().sort_index(ascending=True)
#class는 예약어이므로 ['class']는 접근가능하지만.class는 접근불가

First     216
Second    184
Third     491
Name: class, dtype: int64

In [13]:
#사망생존 인원수
titanic.alive.value_counts().sort_index(ascending=True)

no     549
yes    342
Name: alive, dtype: int64

In [18]:
#이렇게 하나하나 말고, 한번에 모든컬럼 할 수 없나? 
#제시된 열에 대해 values_count() 적용시키고 dict에 저장가능
cols='sex','age','class','alive'
v_conuts={}

for col in cols:
    v_conuts[col]=titanic[col].value_counts()
v_conuts

{'sex': male      577
 female    314
 Name: sex, dtype: int64,
 'age': 24.00    30
 22.00    27
 18.00    26
 28.00    25
 19.00    25
          ..
 55.50     1
 74.00     1
 0.92      1
 70.50     1
 12.00     1
 Name: age, Length: 88, dtype: int64,
 'class': Third     491
 First     216
 Second    184
 Name: class, dtype: int64,
 'alive': no     549
 yes    342
 Name: alive, dtype: int64}

#### 연습문제 2
- 성별에 따른 생존자수와 사망자수의 정보를 갖고 있는 데이터프레임 titanic_y_n 를 생성하시오
    - 0은 생존 1은 사망

![](데이터조작문제.PNG)

In [9]:
#생존자 데이터와 사망자 데이터로 분리
yes=titanic[titanic.alive == 'yes']
yes.head(3)

no=titanic[titanic.alive == 'no']
no.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True

In [13]:
#사망자의 성별 인원수
no_sex=no.sex.value_counts()
no_sex

male      468
female     81
Name: sex, dtype: int64

In [14]:
#생존자의 성별 인원수
yes_sex=yes.sex.value_counts()
yes_sex

female    233
male      109
Name: sex, dtype: int64

In [17]:
#사망자성별, 생존자성별을 가지고 데이터프레임생성
pd.DataFrame([no_sex,yes_sex],index=[0,1])

   male  female
0   468      81
1   109     233

In [21]:
d=titanic.loc[:,['sex','alive']].value_counts()
titanic_y_n=pd.DataFrame(d)
titanic_y_n

                0
sex    alive
male   no     468
female yes    233
male   yes    109
female no      81

In [24]:
pd.pivot_table(titanic_y_n,index='alive',columns='sex')

           0
sex   female male
alive
no        81  468
yes      233  109

#### 연습문제3
- 타이타닉호 승객을 사망자와 생존자 그룹으로 나누고(alive)
- 각 그룹에 대해 미성년자, 청년, 중년, 장년, 노년 승객의 비율을 구하시오.
    - bins=[1,15,25,35,60,99]
    - labels=['미성년자','청년','중년','장년','노년']
    - 각 그룹별 비유의 전체 합은 1이 되어야 한다.

In [25]:
#생존자 데이터와 사망자 데이터로 분리
yes=titanic[titanic.alive == 'yes']
yes.head(3)

no=titanic[titanic.alive == 'no']
no.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True

In [26]:
#라벨값 정의변수
labels=['미성년자','청년','중년','장년','노년']

#범위 간격 정의변수
bins=[1,15,25,35,60,99]

In [37]:
#1이하, 99이상은 NaN으로 처리되서 범위유효성 검사 실시
#bins=[1,15,25,35,60,99] 

np.min(yes.age)
np.min(no.age)
np.max(yes.age)
np.max(no.age)

#지금 데이터에 있는 나이가 1부터 99까지 있는것인지 확인
#보니까 최소가1보다 작은 나이도 있어서 범위를 수정
bins=[0,15,25,35,60,99]

0.42

1.0

80.0

74.0

In [50]:
#카테고리 데이터 생성
bins=[0,15,25,35,60,99]

#사망자/생존자 데이터에 사망자 연령대 컬럼 추가 (보류)
no['age_cut']=pd.cut(no['age'], bins.labels=labels) 
yes['age_cut']=pd.cut(yes['age'], bins.labels=labels)

SyntaxError: expression cannot contain assignment, perhaps you meant "=="? (CreatorTemp/ipykernel_19844/3176964135.py, line 5)

In [40]:
#비율
no['age_cut'].values_count(normalize=True)*100

KeyError: 'age_cut'

#### 연습문제4
- ['id_1','id_2','id_3','id_4'] 와 같은 리스트 요소를
- 내포 for문을 이용해서 생성후 리스트로 추가하시오.

In [49]:
# 고정문자열(id_)과 반복 요소(1,2,3,4)를  조합하는 코드를 내포  for문으로 만들어보세요

['id_'+str(i) for i in range(1,5)]

['id_1', 'id_2', 'id_3', 'id_4']